; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v4 ?v8)
		(pred_6 ?v7)
		(pred_1 ?v2)
		(pred_2 ?v2)
		(pred_4 ?v7 ?v2)
		(pred_5)
		(pred_3 ?v7))

   (:action op_1
       :parameters  (?v5 ?v3)
       :precondition (and (not-eq ?v5 ?v3) 
                          (pred_1 ?v5) (pred_1 ?v3) (pred_2 ?v5))
       :effect (and  (pred_2 ?v3)
		     (not (pred_2 ?v5))))


   (:action op_3
       :parameters (?v6 ?v1)
       :precondition  (and  (pred_6 ?v6) (pred_1 ?v1)
			    (pred_4 ?v6 ?v1) (pred_2 ?v1) (pred_5))
       :effect (and (pred_3 ?v6)
		    (not (pred_4 ?v6 ?v1)) 
		    (not (pred_5))))

   (:action op_2
       :parameters  (?v6  ?v1)
       :precondition  (and  (pred_6 ?v6) (pred_1 ?v1)
			    (pred_3 ?v6) (pred_2 ?v1))
       :effect (and (pred_4 ?v6 ?v1)
		    (pred_5)
		    (not (pred_3 ?v6)))))

; problem
(define (problem ferry-l4-c3)
(:domain ferry)
(:objects obj_03 obj_07 obj_06 obj_04 
          obj_01 obj_05 obj_02 
)
(:init
(pred_1 obj_03)
(pred_1 obj_07)
(pred_1 obj_06)
(pred_1 obj_04)
(pred_6 obj_01)
(pred_6 obj_05)
(pred_6 obj_02)
(not-eq obj_03 obj_07)
(not-eq obj_07 obj_03)
(not-eq obj_03 obj_06)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_07 obj_06)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_06)
(pred_5)
(pred_4 obj_01 obj_07)
(pred_4 obj_05 obj_07)
(pred_4 obj_02 obj_07)
(pred_2 obj_04)
)
(:goal
(and
(pred_4 obj_01 obj_06)
(pred_4 obj_05 obj_03)
(pred_4 obj_02 obj_04)
)
)

(:constraints
  (and
    (sometime-before  (pred_4 obj_01 obj_06) (pred_2 obj_03))
    (sometime-before  (pred_4 obj_05 obj_03) (pred_2 obj_06))
    (sometime-before  (pred_4 obj_02 obj_04) (pred_2 obj_03))
  )
)
)

; plan
1. (op_1 obj_04 obj_07)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_07)
   goals met: 0 of 3
2. (op_3 obj_02 obj_07)
   deleted: (pred_4 obj_02 obj_07) (pred_5)
   added: (pred_3 obj_02)
   goals met: 0 of 3
3. (op_1 obj_07 obj_06)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_06)
   goals met: 0 of 3
4. (op_2 obj_02 obj_06)
   deleted: (pred_3 obj_02)
   added: (pred_4 obj_02 obj_06) (pred_5)
   goals met: 0 of 3
5. (op_1 obj_06 obj_07)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_07)
   goals met: 0 of 3
6. (op_3 obj_05 obj_07)
   deleted: (pred_4 obj_05 obj_07) (pred_5)
   added: (pred_3 obj_05)
   goals met: 0 of 3
7. (op_1 obj_07 obj_03)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_03)
   goals met: 0 of 3
8. (op_2 obj_05 obj_03)
   deleted: (pred_3 obj_05)
   added: (pred_4 obj_05 obj_03) (pred_5)
   goals met: 1 of 3
9. (op_1 obj_03 obj_07)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_07)
   goals met: 1 of 3
10. (op_3 obj_01 obj_07)
   deleted: (pred_4 obj_01 obj_07) (pred_5)
   added: (pred_3 obj_01)
   goals met: 1 of 3
11. (op_1 obj_07 obj_06)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_06)
   goals met: 1 of 3
12. (op_2 obj_01 obj_06)
   deleted: (pred_3 obj_01)
   added: (pred_4 obj_01 obj_06) (pred_5)
   goals met: 2 of 3
13. (op_3 obj_02 obj_06)
   deleted: (pred_4 obj_02 obj_06) (pred_5)
   added: (pred_3 obj_02)
   goals met: 2 of 3
14. (op_1 obj_06 obj_04)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_04)
   goals met: 2 of 3
15. (op_2 obj_02 obj_04)
   deleted: (pred_3 obj_02)
   added: (pred_4 obj_02 obj_04) (pred_5)
   goals met: 3 of 3
